const bcMap = {
  units: {
    9: ["壬", "戌", "申", "午", "辰", "寅", "子"],
    8: ["癸", "亥", "酉", "未", "巳", "卯", "丑"],
    7: ["甲", "子", "戌", "申", "午", "辰", "寅"],
    6: ["乙", "丑", "亥", "酉", "未", "巳", "卯"],
    5: ["丙", "寅", "子", "戌", "申", "午", "辰"],
    4: ["丁", "卯", "丑", "亥", "酉", "未", "巳"],
    3: ["戊", "辰", "寅", "子", "戌", "申", "午"],
    2: ["己", "巳", "卯", "丑", "亥", "酉", "未"],
    1: ["庚", "午", "辰", "寅", "子", "戌", "申"],
    0: ["辛", "未", "巳", "卯", "丑", "亥", "酉"],
  },
  tens: {
    0: {
      3: 1,
      2: 2,
      1: 3,
      0: 4,
      9: 1,
      8: 2,
      7: 3,
      6: 4,
      5: 5,
      4: 6,
    },
    1: {
      1: 1,
      0: 2,
      7: 1,
      6: 2,
      5: 3,
      4: 4,
      3: 5,
      2: 6,
      9: 5,
      8: 6,
    },
    2: {
      5: 1,
      4: 2,
      3: 3,
      2: 4,
      1: 5,
      0: 6,
      9: 3,
      8: 4,
      7: 5,
      6: 6,
    },
  },
  others: {
    /* part 1 */
    2: 0,
    5: 0,
    8: 0,
    11: 0,
    14: 0,
    17: 0,
    20: 0,
    23: 0,
    26: 0,
    29: 0,
    32: 0,
    /* part 2 */
    1: 1,
    4: 1,
    7: 1,
    10: 1,
    13: 1,
    16: 1,
    19: 1,
    22: 1,
    25: 1,
    28: 1,
    31: 1,
    /* part 2 */
    0: 2,
    3: 2,
    6: 2,
    9: 2,
    12: 2,
    15: 2,
    18: 2,
    21: 2,
    24: 2,
    27: 2,
    30: 2,
  },
};

/**
 * 公元纪年转农历纪年
 * @param {number} ceYear 公元纪元年份
 */
function ce2lunisolar(ceYear) {
  if (ceYear <= 0) {
    var year = ceYear * -1;
    var u = year % 10;
    var t = ~~((year / 10) % 10);
    var o = ~~(year / 100);
    if (o > 32) return "unknown";
    var row = bcMap.units[u];
    return row[0] + row[bcMap.tens[bcMap.others[o]][t]];
  }
  // TODO
  return "unknown";
}
